Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Select %@
fr: Sélectionner %@
ko: %@ 선택
tr: %@ seç
vi: Chọn %@
zh_hans: 选择%@
zh_hant: 選擇%@

source: This save reuses the column name %@ while the table is being recreated, and the recreated table would hold it twice. Save the change that frees the name first, then the one that takes it.
fr: Cette sauvegarde réutilise le nom de la colonne %@ pendant que la table est recréée, et la table recréée la contiendra deux fois. Sauvegardez d'abord le changement qui libère le nom, puis celui qui le prend.

source: Assumes a role from its source profile.
fr: Assume un rôle à partir de son profil source.

source: Escaped literals, in the order supplied
fr: Lettres échappées, dans l'ordre fourni
ko: 제공된 순서대로 이스케이프된 리터럴
tr: Verilen sırayla kaçışlanmış değişmez değerler
vi: Các literal đã escape, theo thứ tự được cung cấp
zh_hans: 已转义的字面量，按提供的顺序排列
zh_hant: 已跳脫的字面值，按提供的順序排列

source: The database server enforced this, not TablePro's Safe Mode. You are most likely connected to a read replica, or the server sets new transactions to read-only. Connect to the primary server to write. Server response: %@
fr: Le serveur de base de données l'a imposé, pas le mode sécurisé de TablePro. Vous êtes très probablement connecté à une réplique de lecture, ou le serveur définit de nouvelles transactions comme en lecture seule. Connectez-vous au serveur primaire pour écrire. Réponse du serveur : %@
ko: TablePro의 안전 모드가 아니라 데이터베이스 서버에서 적용한 제한입니다. 읽기 전용 복제본에 연결했거나 서버에서 새 트랜잭션을 읽기 전용으로 설정했을 가능성이 큽니다. 쓰려면 기본 서버에 연결하십시오. 서버 응답: %@
tr: Bunu TablePro'nun Safe Mode ayarı değil, veritabanı sunucusu uyguladı. Büyük olasılıkla bir okuma kopyasına bağlısınız veya sunucu yeni işlemleri salt okunur yapıyor. Yazmak için birincil sunucuya bağlanın. Sunucu yanıtı: %@
vi: Đây là do máy chủ cơ sở dữ liệu áp đặt, không phải Chế độ an toàn của TablePro. Nhiều khả năng bạn đang kết nối tới bản sao chỉ đọc, hoặc máy chủ đặt các giao dịch mới ở chế độ chỉ đọc. Hãy kết nối tới máy chủ chính để ghi. Phản hồi của máy chủ: %@
zh_hans: 这是数据库服务器的限制，不是 TablePro 的安全模式。你很可能连接到了只读副本，或者服务器将新事务设为只读。请连接主服务器以写入。 服务器响应：%@
zh_hant: 這是資料庫伺服器的限制，不是 TablePro 的安全模式。你很可能連線到唯讀副本，或伺服器將新交易設為唯讀。請連線到主要伺服器以寫入。 伺服器回應：%@

source: Sets the value to %@
fr: Définit la valeur à %@

source: Runs on '%@'.
fr: Fonctionne sur '%@'.

source: %1$@ • Color: %2$@
fr: %1$@ • Couleur : %2$@
ko: %1$@ • 색상: %2$@
tr: %1$@ • Renk: %2$@
vi: %1$@ • Màu: %2$@
zh_hans: %1$@ • 颜色：%2$@
zh_hant: %1$@ • 顏色：%2$@

source: This project has no datasets yet.
fr: Ce projet n'a pas encore de données de base.
ko: 이 프로젝트에는 아직 데이터 세트가 없습니다.
tr: Bu projede henüz veri kümesi yok.
vi: Dự án này chưa có dataset nào.
zh_hans: 此项目还没有数据集。
zh_hant: 此專案還沒有資料集。

source: Reserved Shortcut
fr: Accès raccourci réservé
ko: 예약된 단축키
tr: Ayrılmış Kısayol
vi: Phím tắt dành riêng
zh_hans: 保留的快捷键
zh_hant: 保留的快速鍵

source: Deactivate
fr: Désactiver
ko: 비활성화
tr: Devre Dışı Bırak
vi: Hủy kích hoạt
zh_hans: 停用
zh_hant: 停用

source: View name
fr: Voir le nom
ko: 뷰 이름
tr: Görünüm adı
vi: Tên view
zh_hans: 视图名称
zh_hant: 檢視表名稱

# Connecting to '%@' timed out after %lld seconds.
source: Connecting to '%1$@' timed out after %2$lld seconds.
fr: La connexion à '%1$@' a expiré après %2$lld secondes.

source: Syncing…
fr: Synchronisation en cours...
ko: 동기화 중…
vi: Đang đồng bộ…
zh_hans: 正在同步…
zh_hant: 正在同步…

source: History Unavailable
fr: Historique indisponible
ko: 기록을 사용할 수 없음
tr: Geçmiş Kullanılamıyor
vi: Không có lịch sử
zh_hans: 历史不可用
zh_hant: 記錄無法使用

source: Showing all databases
fr: Affichage de toutes les bases de données
ko: 모든 데이터베이스 표시
tr: Tüm veritabanları gösteriliyor
vi: Đang hiển thị tất cả cơ sở dữ liệu
zh_hans: 正在显示所有数据库
zh_hant: 正在顯示所有資料庫

source: Massive
fr: Massif
ko: 매우 큼
tr: Çok Büyük
vi: Cực lớn
zh_hans: 巨大
zh_hant: 巨大

source: %d statements would destroy data and are not allowed yet.
fr: %d déclarations détruiraient les données et ne sont pas encore autorisées.
ko: 구문 %d개가 데이터를 파괴하며 아직 허용되지 않았습니다.
tr: %d ifade veriyi yok eder ve henüz izin verilmedi.
vi: %d câu lệnh sẽ hủy dữ liệu và chưa được cho phép.
zh_hans: %d 条语句会销毁数据，尚未被允许。
zh_hant: %d 條陳述式會銷毀資料，尚未被允許。

source: Apply active filters (Cmd+Return)
fr: Appliquer des filtres actifs (Cmd+Retour)
ko: 활성 필터 적용(Cmd+Return)
tr: Etkin filtreleri uygula (Cmd+Return)
vi: Áp dụng các bộ lọc đang bật (Cmd+Return)
zh_hans: 应用启用的筛选 (Cmd+Return)
zh_hant: 套用啟用的篩選（Cmd+Return）

source: Database Alias
fr: Alias de la base de données
ko: 데이터베이스 별칭
tr: Veritabanı Takma Adı
vi: Bí danh cơ sở dữ liệu
zh_hans: 数据库别名
zh_hant: 資料庫別名

source: %@ is not a Redis database index.
fr: %@ n'est pas un index de base de données Redis.

source: Same options will be applied to all selected tables.
fr: Les mêmes options seront appliquées à toutes les tables sélectionnées.
ko: 선택한 모든 테이블에 동일한 옵션이 적용됩니다.
tr: Aynı seçenekler seçili tüm tablolara uygulanır.
vi: Cùng tùy chọn sẽ được áp dụng cho tất cả bảng đã chọn.
zh_hans: 相同选项将应用于所有选中的表。
zh_hant: 相同的選項將套用至所有選取的資料表。

source: Show row numbers
fr: Afficher les numéros de rangées
ko: 행 번호 보기
tr: Satır numaralarını göster
vi: Hiển thị số thứ tự hàng
zh_hans: 显示行号
zh_hant: 顯示列號

source: Sort Ascending
fr: Trier par ordre croissant
ko: 오름차순 정렬
tr: Artan Sırala
vi: Sắp xếp tăng dần
zh_hans: 升序排列
zh_hant: 遞增排序

source: Are you sure you want to execute this query? %@
fr: Êtes-vous sûr de vouloir exécuter cette requête ? %@
ko: 이 쿼리를 실행하시겠습니까? %@
tr: Bu sorguyu çalıştırmak istediğinize emin misiniz? %@
vi: Bạn có chắc chắn muốn thực thi truy vấn này? %@
zh_hans: 确定要执行此查询吗？ %@
zh_hant: 確定要執行此查詢嗎？ %@

source: Syncs connections, settings, and history across your Macs via iCloud.
fr: Synchronise les connexions, les paramètres et l'historique sur tous vos Macs via iCloud.
ko: iCloud를 통해 Mac 간에 연결, 설정 및 기록을 동기화합니다.
vi: Đồng bộ kết nối, cài đặt và lịch sử giữa các máy Mac qua iCloud.
zh_hans: 通过 iCloud 在多台 Mac 之间同步连接、设置和历史记录。
zh_hant: 透過 iCloud 在你的多台 Mac 之間同步連線、設定與歷程記錄。

# Row %d, column %d: %@, %@, highlighted where %@
source: Row %1$d, column %2$d: %3$@, %4$@, highlighted where %5$@
fr: Rang %1$d, colonne %2$d : %3$@, %4$@, mis en évidence là où %5$@

source: Every column is written when none is ticked.
fr: Chaque colonne est écrite lorsque aucune n'est cochée.

source: Sign in to use your ChatGPT subscription
fr: Connectez-vous pour utiliser votre abonnement ChatGPT.
ko: ChatGPT 구독을 사용하려면 로그인하십시오
tr: ChatGPT aboneliğinizi kullanmak için giriş yapın
vi: Đăng nhập để dùng gói đăng ký ChatGPT của bạn
zh_hans: 登录以使用你的 ChatGPT 订阅
zh_hant: 登入以使用你的 ChatGPT 訂閱

source: The tables you starred here no longer exist.
fr: Les tableaux que vous avez mis en vedette ici n'existent plus.

# %lld in / %lld out tokens
source: %1$lld in / %2$lld out tokens
fr: %1$lld en / %2$lld en jetons sortants
ko: 입력 토큰 %1$lld개 / 출력 토큰 %2$lld개
tr: %lld giriş / %lld çıkış belirteç
vi: %1$lld vào / %2$lld ra token
zh_hans: %lld 输入 / %lld 输出 token
zh_hant: %1$lld 輸入 / %2$lld 輸出 token

source: Line %1$lld: %2$@
fr: Ligne %1$lld : %2$@
ko: %1$lld행: %2$@
tr: Satır %1$lld: %2$@
vi: Dòng %1$lld: %2$@
zh_hans: 第 %1$lld 行：%2$@
zh_hant: 第 %1$lld 行：%2$@

source: Writes 1 file.
fr: Écrit 1 fichier.

source: Open a different file from the Welcome window.
fr: Ouvrez un fichier différent à partir de la fenêtre d'accueil.
ko: 시작 윈도우에서 다른 파일을 여십시오.
tr: Hoş Geldiniz penceresinden farklı bir dosya açın.
vi: Mở tệp khác từ cửa sổ Chào mừng.
zh_hans: 从欢迎窗口打开其他文件。
zh_hant: 從歡迎視窗開啟其他檔案。

source: Add Rule
fr: Ajouter une règle

source: Case-insensitive substring to look for
fr: Sous-chaîne insensible à la casse à rechercher
ko: 찾을 부분 문자열이며 대소문자를 구분하지 않습니다
tr: Aranacak, büyük/küçük harfe duyarsız alt dize
vi: Chuỗi con cần tìm, không phân biệt hoa thường
zh_hans: 要查找的子串，不区分大小写
zh_hant: 要尋找的子字串，不區分大小寫

source: Loading rows…
fr: Chargement des lignes...

source: This database does not explain statements.
fr: Cette base de données ne décrit pas les déclarations.

source: The address does not accept MCP requests.
fr: L'adresse ne prend pas en charge les demandes MCP.

source: This column does not allow NULL, so its default cannot be NULL.
fr: Cette colonne ne permet pas NULL, donc sa valeur par défaut ne peut pas être NULL.

source: Not found in the source.
fr: Pas trouvé dans la source.

source: Dynamic
fr: Dynamique
ko: 동적
tr: Dinamik
vi: Động
zh_hans: 动态
zh_hant: 動態

source: Show All Tables
fr: Afficher toutes les tables
ko: 모든 테이블 보기
vi: Hiện tất cả bảng
zh_hans: 显示所有表
zh_hant: 顯示所有資料表

source: Database file not found: %@
fr: Fichier de base de données introuvable : %@
ko: 데이터베이스 파일을 찾을 수 없습니다: %@
tr: Veritabanı dosyası bulunamadı: %@
vi: Không tìm thấy tệp cơ sở dữ liệu: %@
zh_hans: 未找到数据库文件: %@
zh_hant: 找不到資料庫檔案：%@

source: Success
fr: Succès
ko: 성공
tr: Başarılı
vi: Thành công
zh_hans: 成功
zh_hant: 成功

source: Leave the principal and password blank to use your existing Kerberos ticket. Run kinit user@REALM.COM in Terminal first if you don't have one.
fr: Laissez le principal et le mot de passe vides pour utiliser votre billet Kerberos existant. Exécutez d'abord kinit user@REALM.COM dans le terminal si vous n'en avez pas.
ko: 기존 Kerberos 티켓을 사용하려면 보안 주체와 암호를 비워 두십시오. 티켓이 없으면 먼저 터미널에서 kinit user@REALM.COM을 실행하십시오.
tr: Mevcut Kerberos biletinizi kullanmak için principal ve parolayı boş bırakın. Biletiniz yoksa önce Terminal'de kinit user@REALM.COM çalıştırın.
vi: Để trống principal và mật khẩu để dùng vé Kerberos hiện có. Nếu chưa có, hãy chạy kinit user@REALM.COM trong Terminal trước.
zh_hans: 留空 principal 和密码即可使用现有的 Kerberos 票据。如果没有，请先在终端运行 kinit user@REALM.COM。
zh_hant: 留空 principal 和密碼即可使用現有的 Kerberos 票證。如果沒有，請先在終端機執行 kinit user@REALM.COM。

source: Move Filter Down
fr: Déplacer le filtre vers le bas
ko: 필터를 아래로 이동
tr: Filtreyi Aşağı Taşı
vi: Chuyển bộ lọc xuống
zh_hans: 下移筛选条件
zh_hant: 將篩選條件下移

source: CURTIME()
fr: HEURE CURRENTE()

source: Procedures
fr: Procédures
ko: 프로시저
tr: Prosedürler
zh_hans: 存储过程
zh_hant: 預存程序

source: Select Connections
fr: Sélectionner les connexions
ko: 연결 선택
tr: Bağlantıları Seç
vi: Chọn kết nối
zh_hans: 选择连接
zh_hant: 選擇連線

source: Progress estimated (%d table(s) could not be counted)
fr: Progrès estimé (%d table(s) n'ont pas pu être comptées)
ko: 진행률은 추정치입니다(%d개 테이블의 행 수를 계산할 수 없음)
tr: Tahmini ilerleme (%d tablo sayılamadı)
vi: Tiến trình ước lượng (%d bảng không thể đếm)
zh_hans: 进度为估算值（%d 个表无法计数）
zh_hant: 進度為估計值（%d 個資料表無法計數）

source: Server metrics
fr: Mesures du serveur
ko: 서버 지표
tr: Sunucu metrikleri
vi: Chỉ số máy chủ
zh_hans: 服务器指标
zh_hant: 伺服器指標

source: Session status
fr: Statut de la session
ko: 세션 상태
tr: Oturum durumu
vi: Tình trạng phiên
zh_hans: 会话状况
zh_hant: 工作階段狀況

source: %lld ^[columns](inflect: true)
fr: %lld ^[colonnes](inflect: vrai)
ko: %lld개 열
tr: %lld sütun
vi: %lld cột
zh_hans: %lld列
zh_hant: %lld 個欄位

source: Split Column…
fr: Colonne divisée...
ko: 열 분할…
tr: Sütunu Ayır…
vi: Tách cột…
zh_hans: 拆分列…
zh_hant: 拆分欄位…

source: TablePro doesn't recognize the database type “%@”.
fr: TablePro ne reconnaît pas le type de base de données "%@".

source: ER Diagram
fr: Diagramme ER
ko: ER 다이어그램
tr: ER Diyagramı
vi: Sơ đồ ER
zh_hans: ER 图
zh_hant: ER 圖

source: Why the sessions panel could not be read
fr: Pourquoi le panneau des sessions ne pouvait pas être lu ?

source: The column keeps %1$lld of its %2$lld digits after the point, so a longer fraction is rounded.
fr: La colonne conserve %1$lld de ses %2$lld chiffres après le point, de sorte qu'une fraction plus longue est arrondie.

source: Check for Updates…
fr: Vérifiez les mises à jour...
ko: 업데이트 확인…
tr: Güncellemeleri Kontrol Et…
vi: Kiểm tra cập nhật…
zh_hans: 检查更新…
zh_hant: 檢查更新…

source: Pass at least one column.
fr: Passer au moins une colonne.
ko: 열을 하나 이상 전달하십시오.
tr: En az bir sütun geçirin.
vi: Hãy truyền ít nhất một cột.
zh_hans: 请至少传入一个列。
zh_hant: 請至少傳入一個欄位。

source: Query parameters (:name syntax)
fr: Paramètres de la requête (:syntaxe de nom)
ko: 쿼리 매개변수(:name 구문)
tr: Sorgu parametreleri (:name söz dizimi)
vi: Tham số truy vấn (cú pháp :name)
zh_hans: 查询参数（:name 语法）
zh_hant: 查詢參數（:name 語法）

source: Import Not Supported
fr: L'importation n'est pas prise en
ko: 가져오기가 지원되지 않음
tr: İçe Aktarma Desteklenmiyor
vi: Không hỗ trợ nhập
zh_hans: 不支持导入
zh_hant: 不支援匯入

source: Access Key + Secret Key
fr: Clé d'accès + Clé secrète

source: Clear Saved Changes…
fr: Effacer les modifications enregistrées...
ko: 저장된 변경 사항 지우기…
tr: Kaydedilen Değişiklikleri Sil…
vi: Xoá các thay đổi đã lưu…
zh_hans: 清除已保存的更改…
zh_hant: 清除已儲存的變更…

source: Show All (%@)
fr: Afficher tout (%@)

source: Changed since the save
fr: Modifié depuis le sauvegarde
ko: 저장 후 변경됨
tr: Kaydetmeden bu yana değişti
vi: Đã thay đổi kể từ lần lưu
zh_hans: 自保存后已更改
zh_hant: 自儲存後已變更

source: View License
fr: Voir la licence
ko: 라이선스 보기
tr: Lisansı Görüntüle
vi: Xem giấy phép
zh_hans: 查看许可证
zh_hant: 查看授權

source: (optional)
fr: (facultatif)
ko: (선택 사항)
tr: (isteğe bağlı)
vi: (tùy chọn)
zh_hans: （可选）
zh_hant: （選填）

source: Plugin registry requires a newer app version
fr: Le registre des plugins nécessite une version plus récente de l'application.
ko: 플러그인 레지스트리를 사용하려면 더 최신 버전의 앱이 필요합니다
tr: Eklenti deposu daha yeni bir uygulama sürümü gerektiriyor
vi: Kho plugin yêu cầu phiên bản ứng dụng mới hơn
zh_hans: 插件注册表需要更新版本的应用
zh_hant: 外掛註冊需要更新版本的應用程式

source: Operation name from list_maintenance_operations
fr: Nom de l'opération de la liste_maintenance_operations
ko: list_maintenance_operations에서 얻은 작업 이름
tr: list_maintenance_operations'tan alınan işlem adı
vi: Tên thao tác lấy từ list_maintenance_operations
zh_hans: 来自 list_maintenance_operations 的操作名称
zh_hant: 來自 list_maintenance_operations 的作業名稱

source: Earliest executed_at to include, Unix epoch seconds (inclusive, optional)
fr: Le plus ancien exécuté_at à inclure, secondes de l'époque Unix (incluant, facultatif)
ko: 포함할 가장 이른 executed_at 값(Unix epoch 초, 경계 포함, 선택 사항)
tr: Dahil edilecek en erken executed_at, Unix epoch saniyesi (dahil, isteğe bağlı)
vi: Mốc executed_at sớm nhất được tính, giây Unix epoch (bao gồm mốc này, tùy chọn)
zh_hans: 要包含的最早 executed_at，Unix 纪元秒（含，可选）
zh_hant: 要納入的最早 executed_at，Unix 紀元秒（含，選用）

source: Select a plugin to view details
fr: Sélectionnez un plugin pour afficher les détails.
ko: 세부사항을 볼 플러그인을 선택하십시오
tr: Ayrıntıları görmek için bir eklenti seçin
vi: Chọn plugin để xem chi tiết
zh_hans: 选择插件查看详情
zh_hant: 選擇外掛以檢視詳細資訊

source: The source could not be read with its filter: %@
fr: La source ne pouvait pas être lu avec son filtre : %@

source: %@ is read-only, so nothing can be written to it.
fr: %@ est en lecture seule, donc rien ne peut être écrit dessus.

source: Stopped after %@
fr: Arrêté après %@
ko: %@ 후 중지됨
tr: %@ sonra durdu
vi: Đã dừng sau %@
zh_hans: %@ 后已停止
zh_hant: %@ 後已停止

source: No objects found
fr: Aucun objet trouvé
ko: 객체를 찾을 수 없음
vi: Không tìm thấy đối tượng
zh_hans: 未找到对象
zh_hant: 找不到物件

source: Whether it is set
fr: Que ce soit réglé
ko: 설정되어 있는지 여부
tr: Ayarlanmış olup olmadığı
vi: Đã được đặt hay chưa
zh_hans: 是否已设置
zh_hant: 是否已設定

source: Toggle Header Row
fr: Changer la ligne d'en-tête

source: Timestamp precision
fr: Précision de l'horodatage
ko: 타임스탬프 정밀도
tr: Zaman damgası hassasiyeti
vi: Độ chính xác timestamp
zh_hans: 时间戳精度
zh_hant: 時間戳記精度

source: Each column can be mapped from only one field.
fr: Chaque colonne ne peut être mappée qu'à partir d'un seul champ.
ko: 각 열에는 하나의 필드만 매핑할 수 있습니다.
tr: Her sütun yalnızca bir alandan eşlenebilir.
vi: Mỗi cột chỉ có thể được ánh xạ từ một trường.
zh_hans: 每列只能映射自一个字段。
zh_hant: 每個欄位只能對應自一個欄位。

source: A foreign table
fr: Une table étrangère

source: File Properties
fr: Propriétés du fichier

source: Close All Tabs
fr: Fermer toutes les onglets
ko: 모든 탭 닫기
tr: Tüm Sekmeleri Kapat
vi: Đóng tất cả tab
zh_hans: 关闭所有标签页
zh_hant: 關閉所有分頁

source: BEFORE, AFTER, or INSTEAD OF
fr: AVANT, APRÈS, OU AU LIEU DE
ko: BEFORE, AFTER 또는 INSTEAD OF
tr: BEFORE, AFTER veya INSTEAD OF
vi: BEFORE, AFTER hoặc INSTEAD OF
zh_hans: BEFORE、AFTER 或 INSTEAD OF
zh_hant: BEFORE、AFTER 或 INSTEAD OF

source: Responding
fr: Répondant
ko: 응답 중
tr: Yanıt veriyor
vi: Đang phản hồi
zh_hans: 响应中
zh_hant: 回應中

source: Publish connections to a shared folder your team reads from. Passwords are never included.
fr: Publiez les connexions vers un dossier partagé que votre équipe lit. Les mots de passe ne sont jamais inclus.
ko: 팀이 사용하는 공유 폴더에 연결을 게시합니다. 암호는 포함되지 않습니다.
tr: Bağlantıları, takımınızın okuduğu paylaşılan bir klasöre yayınlayın. Parolalar hiçbir zaman dahil edilmez.
vi: Xuất bản các kết nối vào một thư mục dùng chung mà nhóm bạn đọc từ đó. Mật khẩu không bao giờ được đưa vào.
zh_hans: 将连接发布到团队读取的共享文件夹。密码不会被包含在内。
zh_hant: 將連線發佈到團隊讀取的共用資料夾。密碼絕不會包含在內。

source: METADATA
fr: Métadonnées
ko: 메타데이터
tr: META VERİ
vi: SIÊU DỮ LIỆU
zh_hans: 元数据
zh_hant: 中繼資料

source: Databases and objects to back up
fr: Base de données et objets à sauvegarder

source: Compare again, or exclude the tables not compared yet: %@.
fr: Comparez à nouveau, ou excluez les tableaux qui n'ont pas encore été comparés : %@.

source: A tag named “%@” already exists.
fr: Un tag nommé "%@" existe déjà.
ko: “%@”라는 이름의 태그가 이미 있습니다.
tr: “%@” adlı bir etiket zaten var.
vi: Đã có thẻ tên “%@”.
zh_hans: 已有名为“%@”的标签。
zh_hant: 已有名為「%@」的標籤。

source: TablePro couldn't reach the plugin registry to update this plugin. Check your connection and reopen TablePro.
fr: TablePro n'a pas pu accéder au registre des plug-ins pour mettre à jour ce plugin. Vérifiez votre connexion et rouvrez TablePro.
ko: TablePro에서 이 플러그인을 업데이트하기 위해 플러그인 레지스트리에 연결할 수 없습니다. 연결을 확인하고 TablePro를 다시 여십시오.
tr: TablePro bu eklentiyi güncellemek için eklenti deposuna ulaşamadı. Bağlantınızı denetleyip TablePro'yu yeniden açın.
vi: TablePro không thể truy cập registry plugin để cập nhật plugin này. Kiểm tra kết nối mạng và mở lại TablePro.
zh_hans: TablePro 无法访问插件注册表来更新此插件。请检查网络连接并重新打开 TablePro。
zh_hant: TablePro 無法連上外掛註冊來更新此外掛。請檢查你的網路連線並重新開啟 TablePro。

source: Update %@ plugin
fr: Mise à jour du plugin %@
ko: %@ 플러그인 업데이트
tr: %@ eklentisini güncelle
vi: Cập nhật plugin %@
zh_hans: 更新 %@ 插件
zh_hant: 更新 %@ 外掛

source: Pro features stop here right away. You can activate this license again later.
fr: Les fonctionnalités Pro s'arrêtent ici tout de suite. Vous pouvez activer cette licence à nouveau plus tard.
ko: Pro 기능이 이 Mac에서 즉시 중지됩니다. 나중에 이 라이선스를 다시 활성화할 수 있습니다.
tr: Pro özellikleri burada hemen durur. Bu lisansı daha sonra yeniden etkinleştirebilirsiniz.
vi: Các tính năng Pro dừng ngay tại đây. Bạn có thể kích hoạt lại giấy phép này sau.
zh_hans: Pro 功能会在此立即停用。你之后可以重新激活此许可证。
zh_hant: Pro 功能會在此立即停用。你之後可以重新啟用此授權。

source: Choose a name the source does not already have.
fr: Choisissez un nom que la source n'a pas déjà.

source: Export query results or table data to CSV, JSON, or SQL
fr: Exporter les résultats de la requête ou les données de la table vers CSV, JSON ou SQL.
ko: 쿼리 결과 또는 테이블 데이터를 CSV, JSON 또는 SQL로 내보냅니다
tr: Sorgu sonuçlarını veya tablo verilerini CSV, JSON veya SQL olarak dışa aktar
vi: Xuất kết quả truy vấn hoặc dữ liệu bảng ra CSV, JSON hoặc SQL
zh_hans: 将查询结果或表数据导出为 CSV、JSON 或 SQL
zh_hant: 將查詢結果或資料表資料匯出為 CSV、JSON 或 SQL

source: Transfer %1$lld table into %2$@?
fr: Transférer la table %1$lld dans %2$@?

source: Connections the client may use, ordered by name
fr: Les connexions que le client peut utiliser, triées par ordre alphabétique.
ko: 클라이언트가 사용할 수 있는 연결이며 이름순으로 정렬됩니다
tr: İstemcinin kullanabileceği bağlantılar, ada göre sıralı
vi: Các kết nối mà client được dùng, sắp xếp theo tên
zh_hans: 客户端可以使用的连接，按名称排序
zh_hant: 用戶端可以使用的連線，按名稱排序

source: right curly bracket
fr: Braceau croisé droit
ko: 닫는 중괄호
tr: sağ süslü parantez
vi: dấu ngoặc nhọn đóng
zh_hans: 右花括号
zh_hant: 右大括號

source: Invalid license key format. Check for typos and try again.
fr: Format de clé de licence invalide. Vérifiez les fautes de frappe et réessayez.
ko: 라이선스 키 형식이 올바르지 않습니다. 오타를 확인한 후 다시 시도하십시오.
tr: Geçersiz lisans anahtarı biçimi. Yazım hatalarını kontrol edip tekrar deneyin.
vi: Định dạng mã giấy phép không hợp lệ. Kiểm tra lỗi chính tả và thử lại.
zh_hans: 许可证密钥格式无效。请检查是否有拼写错误后重试。
zh_hant: 授權金鑰格式無效。請檢查是否有拼字錯誤後再試一次。

source: Comma-separated tables to use. All loaded tables when omitted
fr: Des tableaux séparés par virgule à utiliser. Tous les tableaux chargés lorsqu'ils sont omis
ko: 사용할 테이블을 쉼표로 구분합니다. 생략하면 로드된 모든 테이블입니다
tr: Kullanılacak, virgülle ayrılmış tablolar. Boş bırakıldığında yüklü tüm tablolar
vi: Danh sách bảng cần dùng, phân tách bằng dấu phẩy. Bỏ trống nghĩa là mọi bảng đã nạp
zh_hans: 要使用的表，用逗号分隔。省略则表示所有已加载的表
zh_hant: 要使用的資料表，用逗號分隔。省略則表示所有已載入的資料表

source: This machine is not activated.
fr: Cette machine n'est pas activée.
ko: 이 컴퓨터는 활성화되어 있지 않습니다.
tr: Bu makine etkinleştirilmemiş.
vi: Máy này chưa được kích hoạt.
zh_hans: 此设备未激活。
zh_hant: 此機器尚未啟用。

source: Could not build an INSERT for %@.
fr: Impossible de construire une INSERT pour %@.

source: Changes
fr: Changements
ko: 변경 사항
tr: Değişiklikler
vi: Thay đổi
zh_hans: 更改
zh_hant: 變更

source: The schema change to make, in plain language
fr: Le changement de schéma à faire, en langage clair
ko: 일상어로 표현한, 적용할 스키마 변경
tr: Yapılacak şema değişikliği, sade dille
vi: Thay đổi schema cần thực hiện, bằng ngôn ngữ đời thường
zh_hans: 要做的 Schema 变更，用日常语言表达
zh_hant: 要做的綱要變更，用日常語言表達

source: name
fr: nom
ko: 이름
tr: ad
vi: tên
zh_hans: 名称
zh_hant: 名稱

source: This engine has no SQL dialect, so it cannot produce SQL output.
fr: Ce moteur n'a pas de dialecte SQL, il ne peut donc pas produire de sortie SQL.
ko: 이 엔진에는 SQL 방언이 없어 SQL 출력을 생성할 수 없습니다.
tr: Bu motorun bir SQL lehçesi yok, bu yüzden SQL çıktısı üretemiyor.
vi: Engine này không có phương ngữ SQL nên không thể tạo đầu ra SQL.
zh_hans: 此引擎没有 SQL 方言，因此无法生成 SQL 输出。
zh_hant: 此引擎沒有 SQL 方言，因此無法產生 SQL 輸出。

source: SQLite is file-based
fr: SQLite est basé sur des fichiers.
ko: SQLite는 파일 기반입니다
tr: SQLite dosya tabanlıdır
vi: SQLite dựa trên tệp
zh_hans: SQLite 基于文件
zh_hant: SQLite 以檔案為基礎

source: Drop Materialized View
fr: Déposer la vue matérialisée
ko: 구체화된 뷰 삭제
tr: Materyalize Görünümü Sil
vi: Xóa Materialized View
zh_hans: 删除物化视图
zh_hant: 捨棄具體化檢視表

source: Allowing is remembered until TablePro quits.
fr: L'autorisation est mémorisée jusqu'à ce que TablePro se termine.

source: Field name
fr: Nom du champ

source: Failed to load referenced row
fr: Échec du chargement de la ligne référencée.
ko: 참조된 행을 불러오지 못했습니다
tr: Referans satır yüklenemedi
vi: Không thể tải dòng tham chiếu
zh_hans: 无法加载引用行
zh_hant: 無法載入參照的列

source: Manual
fr: Manuel
ko: 수동
tr: Manuel
vi: Thủ công
zh_hans: 手动
zh_hant: 手動

source: Use “%@” anyway
fr: Utilisez "%@" de toute façon.
ko: 그래도 “%@” 사용
tr: Yine de “%@” kullan
vi: Vẫn dùng “%@”
zh_hans: 仍然使用“%@”
zh_hant: 仍然使用“%@”

source: Finding…
fr: Trouver...

source: Could Not Open Table
fr: Impossible d'ouvrir la table
ko: 테이블을 열 수 없음
tr: Tablo Açılamadı
vi: Không thể mở bảng
zh_hans: 无法打开表
zh_hant: 無法開啟資料表

source: Malformed deep link path: %@
fr: Chemin de lien profond mal formé : %@
ko: 잘못된 딥 링크 경로: %@
tr: Hatalı biçimlendirilmiş deep link yolu: %@
vi: Đường dẫn deep link không hợp lệ: %@
zh_hans: 深层链接路径格式错误：%@
zh_hant: 深層連結路徑格式錯誤：%@

source: Choose Dump File
fr: Choisissez le fichier de déchargement
ko: 덤프 파일 선택
tr: Döküm Dosyası Seç
vi: Chọn tệp dump
zh_hans: 选择转储文件
zh_hant: 選擇備份檔

source: SOCKS proxy port must be between 1 and 65535
fr: Le port proxy SOCKS doit être entre 1 et 65535.
ko: SOCKS 프록시 포트는 1~65535 사이여야 합니다
tr: SOCKS proxy portu 1 ile 65535 arasında olmalı
vi: Cổng SOCKS proxy phải nằm trong khoảng 1 đến 65535
zh_hans: SOCKS 代理端口必须在 1 到 65535 之间
zh_hant: SOCKS 代理連接埠必須介於 1 到 65535 之間

source: Tab id, accepted by focus_query_tab
fr: ID de la barre d'onglets, accepté par focus_query_tab
ko: focus_query_tab이 받는 탭 id
tr: focus_query_tab tarafından kabul edilen sekme kimliği
vi: Tab id, được focus_query_tab chấp nhận
zh_hans: 标签页 id，可被 focus_query_tab 接受
zh_hant: 標籤頁 id，可被 focus_query_tab 接受
